Tekla Open API Reference for Tekla Structures 2025
RebarGeometry Class
 The RebarGeometry class represents a single physical reinforcing bar - the building block of a mesh, a rebar group and even a single rebar. It contains the physical reinforcing bar points in 3D space.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarGeometry
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarGeometry
<SerializableAttribute>
Public NotInheritable Class RebarGeometry
The RebarGeometry type exposes the following members.
Properties
Name | Description
BendingRadiuses
The bending radiuses of the wire.
Diameter
The diameter of the wire.
Shape
The physical points of the reinforcing bar.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
       public void Example1()
       {
           RebarGroup Group = new RebarGroup();
           ArrayList RebarGeoms = Group.GetRebarGeometries(true);
           foreach (RebarGeometry Rebar in RebarGeoms)
           {
               if (Rebar != null)
               {
                   Console.WriteLine("Wire {0} has the following points:");
                   foreach (Point p in Rebar.Shape.Points)
                   {
                       Console.WriteLine("[{0},{1},{2}]", p.X, p.Y, p.Z);
                   }
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace